configuration/src/InformationRegisters/АдресаПолучателей/АдресаПолучателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АдресаПолучателей</name>
  <resources>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Мессенджер</name>
    <type>
      <types>CatalogRef.Мессенджеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Филиалы</types>
      <types>EnumRef.ТипыСлужебногоКанала</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>RocketChatID</name>
    <comment>Имя пользователя RocketChat (значение поля &quot;username&quot;)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата и время создания пользователя</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРедмайн</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьВсеОповещения</name>
    <comment>Хранит признак, что пользователь отключил оповещения в настройках.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольВОтделеIT</name>
    <comment>Хранит роль пользователя в IT-отделе (у роли пометка ПринадлежитITОтделу)</comment>
    <type>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаПоУмолчанию</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРабочийСтол</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиОповещений</name>
    <attributes>
      <name>КатегорияОповещения</name>
      <type>
        <types>EnumRef.КатегорииСообщенийПользователя</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлектроннаяПочта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОповещениеВРабочийСтол</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОтправки</name>
      <type>
        <types>EnumRef.ЧастотаОповещенийПользователя</types>
      </type>
    </attributes>
    <attributes>
      <name>СистемаВзаимодействия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/АдресаПолучателей/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавить запись в регистр
//
// Параметры:
//  Получатель		 - СправочникСсылка.Пользователи, СправочникСсылка.Филиалы, ПеречислениеСсылка.ТипыСлужебногоКанала	 - Получатель сообщения
//  Мессенджер		 - СправочникСсылка.Мессенджеры																		 - выбранный мессенджер
//  Адрес			 - Строка																							 - адрес канала получателя
//  Идентификатор	 - Строка																							 - идентификатор канала получателя
//
Процедура Добавить(Знач Получатель, Знач Мессенджер, Знач Адрес, Знач Идентификатор = "") Экспорт 
	
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Получатель.Установить(Получатель);
	Набор.Отбор.Мессенджер.Установить(Мессенджер);  
	
	Запись = Набор.Добавить();
	Запись.Получатель = Получатель;
	Запись.Мессенджер = Мессенджер;
	Запись.Адрес = Адрес;  
	Запись.Идентификатор = Идентификатор;  
	
	Набор.Записать();
	
КонецПроцедуры

// Обновляет идентификаторы пользователей SDMS
//
Процедура ОбновитьИдентификаторыПользователейSDMS() Экспорт
	
	ПочтаПользователь = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка,
	|	Пользователи.Почта КАК Почта,
	|	ЕСТЬNULL(АдресаПолучателей.Адрес, """") КАК Адрес,
	|	ЕСТЬNULL(АдресаПолучателей.Идентификатор, """") КАК Идентификатор
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресаПолучателей КАК АдресаПолучателей
	|		ПО (АдресаПолучателей.Получатель = Пользователи.Ссылка)
	|			И (АдресаПолучателей.Мессенджер = &ОсновнойМессенджер)
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И НЕ Пользователи.Недействителен
	|	И Пользователи.Почта <> """"
	|	И НЕ Пользователи.Служебный";
	
	Мессенджер = Константы.ОсновнойМессенджер.Получить();
	Запрос.УстановитьПараметр("ОсновнойМессенджер", Мессенджер);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПочтаПользователь.Вставить(НРег(Выборка.Почта), Новый Структура("Ссылка, Адрес, Идентификатор", 
			Выборка.Ссылка, Выборка.Адрес, Выборка.Идентификатор));
	КонецЦикла;  
	
	Обработка = Справочники.Мессенджеры.ПолучитьОбработкуМессенджера(Мессенджер);
	
	Если Обработка <> Неопределено Тогда
		Обработка.ОбновитьИдентификаторыПользователейSDMS(ПочтаПользователь);
	КонецЕсли;	
		
КонецПроцедуры

// Отправика сообщения
//
// Параметры:
//  ТекстСообщения	 - Строка																						 - Сообщение
//  Получатель		 - СправочникСсылка.Пользователи, СправочникСсылка.Филиалы, ПеречислениеСсылка.ТипыСлужебногоКанала	 - Получатель сообщения
//
Процедура ОтправитьСообщение(ТекстСообщения, Получатель) Экспорт
	
	Обработка = Справочники.Мессенджеры.ПолучитьОбработкуМессенджера();
	
	Если Обработка <> Неопределено Тогда
		Адрес = ПолучитьАдресПолучателя(Получатель);
		Обработка.ОтправитьСообщение(ТекстСообщения, Адрес);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьАдресПолучателя(Получатель)
	
	Результат = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Мессенджеры.Ссылка КАК Ссылка,
	|	Мессенджеры.ИспользуетсяИдентификатор КАК ИспользуетсяИдентификатор
	|ПОМЕСТИТЬ ДанныеМессенджер
	|ИЗ
	|	Справочник.Мессенджеры КАК Мессенджеры
	|ГДЕ
	|	Мессенджеры.Ссылка = &ОсновнойМессенджер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДанныеМессенджер.ИспользуетсяИдентификатор
	|			ТОГДА ЕСТЬNULL(АдресаПолучателей.Идентификатор, """")
	|		ИНАЧЕ ЕСТЬNULL(АдресаПолучателей.Адрес, """")
	|	КОНЕЦ КАК АдресПолучателя
	|ИЗ
	|	РегистрСведений.АдресаПолучателей КАК АдресаПолучателей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеМессенджер КАК ДанныеМессенджер
	|		ПО (АдресаПолучателей.Получатель = &Получатель)
	|			И АдресаПолучателей.Мессенджер = ДанныеМессенджер.Ссылка"; 
	
	ОсновнойМессенджер = Константы.ОсновнойМессенджер.Получить();	
	Запрос.УстановитьПараметр("ОсновнойМессенджер", ОсновнойМессенджер);	
	Запрос.УстановитьПараметр("Получатель", Получатель);	
	
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда  
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.АдресПолучателя;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
